sdw333/nRF5_SDK/components/ble/ble_dtm/ble_dtm.c
#ifdef NRF52840_XXAA
                    // Workaround for Errata ID 164
                    *(volatile uint32_t *)0x4000173C &= ~0x80000000;

                    // Workaround for Errata ID 191
                    *(volatile uint32_t *) 0x40001740 = ((*((volatile uint32_t *) 0x40001740)) & 0x7FFFFFFF);
#endif
                    // Disable the workaround for nRF52840 errata 172.
                    set_strict_mode(0);
                    ERRATA_172_TIMER->TASKS_SHUTDOWN = 1;
                    errata_172_wa_enabled = false;
                
                    return radio_init();

                case LE_PHY_2M:
                    m_radio_mode        = RADIO_MODE_MODE_Ble_2Mbit;
                    m_packetHeaderPlen  = RADIO_PCNF0_PLEN_16bit;

#ifdef NRF52840_XXAA
                    // Workaround for Errata ID 164
                    *(volatile uint32_t *)0x4000173C &= ~0x80000000;

                    // Workaround for Errata ID 191
                    *(volatile uint32_t *) 0x40001740 = ((*((volatile uint32_t *) 0x40001740)) & 0x7FFFFFFF);
#endif

                    // Disable the workaround for nRF52840 errata 172.
                    set_strict_mode(0);
                    ERRATA_172_TIMER->TASKS_SHUTDOWN = 1;
                    errata_172_wa_enabled = false;
                
                    return radio_init();

                case LE_PHY_LE_CODED_S8:
#ifdef NRF52840_XXAA
                    m_radio_mode        = RADIO_MODE_MODE_Ble_LR125Kbit;
                    m_packetHeaderPlen  = RADIO_PCNF0_PLEN_LongRange;

                    // Workaround for Errata ID 164
                    *(volatile uint32_t *)0x4000173C |= 0x80000000;
                    *(volatile uint32_t *)0x4000173C = ((*(volatile uint32_t *)0x4000173C & 0xFFFFFF00) | 0x5C);

                    //  Workaround for Errata ID 191
                    *(volatile uint32_t *) 0x40001740 = ((*((volatile uint32_t *) 0x40001740)) & 0x7FFF00FF) | 0x80000000 | (((uint32_t)(196)) << 8);

                    // Enable the workaround for nRF52840 errata 172 on affected devices.
                    if ((*(volatile uint32_t *)0x40001788) == 0)
                    {
                        errata_172_wa_enabled = true;
                    }

                    return radio_init();
#else
                    m_event = LE_TEST_STATUS_EVENT_ERROR;
                    return DTM_ERROR_ILLEGAL_CONFIGURATION;
#endif // NRF52840_XXAA
                case LE_PHY_LE_CODED_S2:
#ifdef NRF52840_XXAA
                    m_radio_mode        = RADIO_MODE_MODE_Ble_LR500Kbit;
                    m_packetHeaderPlen  = RADIO_PCNF0_PLEN_LongRange;

                    // Workaround for Errata ID 164
                    *(volatile uint32_t *)0x4000173C |= 0x80000000;
                    *(volatile uint32_t *)0x4000173C = ((*(volatile uint32_t *)0x4000173C & 0xFFFFFF00) | 0x5C);

                    //  Workaround for Errata ID 191
                    *(volatile uint32_t *) 0x40001740 = ((*((volatile uint32_t *) 0x40001740)) & 0x7FFF00FF) | 0x80000000 | (((uint32_t)(196)) << 8);

                    // Enable the workaround for nRF52840 errata 172 on affected devices.
                    if ((*(volatile uint32_t *)0x40001788) == 0)
                    {
                        errata_172_wa_enabled = true;
                    }

                    return radio_init();
#else
                    m_event = LE_TEST_STATUS_EVENT_ERROR;
                    return DTM_ERROR_ILLEGAL_CONFIGURATION;
#endif
                default:
                    m_event = LE_TEST_STATUS_EVENT_ERROR;
                    return DTM_ERROR_ILLEGAL_CONFIGURATION;
            }
        }
        else if (freq == LE_TEST_SETUP_SELECT_MODULATION)
        {
            if (length > 0x01) 
            {
                m_event = LE_TEST_STATUS_EVENT_ERROR;
                return DTM_ERROR_ILLEGAL_CONFIGURATION;
            }
            // Only standard modulation is supported.
        }
        else if (freq == LE_TEST_SETUP_READ_SUPPORTED)
        {
            if (length != 0x00) 
            {
                m_event = LE_TEST_STATUS_EVENT_ERROR;
                return DTM_ERROR_ILLEGAL_CONFIGURATION;
            }
            // 0XXXXXXXXXXX0110 indicate that 2Mbit and DLE is supported and stable modulation is not supported (No nRF5 device supports this).
            m_event = 0x0006;
        }
        else if (freq == LE_TEST_SETUP_READ_MAX)
        {
            // Read max supported value.
            switch (length)
            {
                case 0x00:
                    // Read supportedMaxTxOctets
                    m_event = 0x01FE;
                    break;

                case 0x01:
                    // Read supportedMaxTxTime
                    m_event = 0x4290;
                    break;

                case 0x02:
                    // Read supportedMaxRxOctets
                    m_event = 0x01FE;
                    break;

                case 0x03:
                    // Read supportedMaxRxTime
                    m_event = 0x4290;
                    break;

                default:
                    m_event = LE_TEST_STATUS_EVENT_ERROR;
                    return DTM_ERROR_ILLEGAL_CONFIGURATION;
            }
        }
        else
        {
            m_event = LE_TEST_STATUS_EVENT_ERROR;
            return DTM_ERROR_ILLEGAL_CONFIGURATION;
        }
        return DTM_SUCCESS;
    }

    if (cmd == LE_TEST_END)
    {
        if (m_state == STATE_IDLE)
        {
            // Sequencing error - only rx or tx test may be ended!
            m_event = LE_TEST_STATUS_EVENT_ERROR;
            return DTM_ERROR_INVALID_STATE;
        }
        m_event = LE_PACKET_REPORTING_EVENT | m_rx_pkt_count;
        dtm_test_done();
        return DTM_SUCCESS;
    }

    if (m_state != STATE_IDLE)
    {
        // Sequencing error - only TEST_END/RESET are legal while test is running
        // Note: State is unchanged; ongoing test not affected
        m_event = LE_TEST_STATUS_EVENT_ERROR;
        return DTM_ERROR_INVALID_STATE;
    }

    // Check for illegal values of m_phys_ch. Skip the check if the packet is vendor spesific.
    if (payload != DTM_PKT_VENDORSPECIFIC && m_phys_ch > PHYS_CH_MAX)
    {
        // Parameter error
        // Note: State is unchanged; ongoing test not affected
        m_event = LE_TEST_STATUS_EVENT_ERROR;

        return DTM_ERROR_ILLEGAL_CHANNEL;
    }

    m_rx_pkt_count = 0;

    if (cmd == LE_RECEIVER_TEST)
    {
        // Zero fill all pdu fields to avoid stray data from earlier test run
        memset(&m_pdu, 0, DTM_PDU_MAX_MEMORY_SIZE);
        radio_prepare(RX_MODE);                      // Reinitialize "everything"; RF interrupts OFF
        m_state = STATE_RECEIVER_TEST;
        return DTM_SUCCESS;
    }

    if (cmd == LE_TRANSMITTER_TEST)
    {
        // Check for illegal values of m_packet_length. Skip the check if the packet is vendor spesific.
        if (m_packet_type != DTM_PKT_TYPE_VENDORSPECIFIC && m_packet_length > DTM_PAYLOAD_MAX_SIZE)
        {
            // Parameter error
            m_event = LE_TEST_STATUS_EVENT_ERROR;
            return DTM_ERROR_ILLEGAL_LENGTH;
        }


        m_pdu.content[DTM_LENGTH_OFFSET] = m_packet_length;
        // Note that PDU uses 4 bits even though BLE DTM uses only 2 (the HCI SDU uses all 4)
        switch (m_packet_type)
        {
            case DTM_PKT_PRBS9:
                m_pdu.content[DTM_HEADER_OFFSET] = DTM_PDU_TYPE_PRBS9;
                // Non-repeated, must copy entire pattern to PDU
                memcpy(m_pdu.content + DTM_HEADER_SIZE, m_prbs_content, m_packet_length);
                break;

            case DTM_PKT_0X0F:
                m_pdu.content[DTM_HEADER_OFFSET] = DTM_PDU_TYPE_0X0F;
                // Bit pattern 00001111 repeated
                memset(m_pdu.content + DTM_HEADER_SIZE, RFPHY_TEST_0X0F_REF_PATTERN, m_packet_length);
                break;

            case DTM_PKT_0X55:
                m_pdu.content[DTM_HEADER_OFFSET] = DTM_PDU_TYPE_0X55;
                // Bit pattern 01010101 repeated
                memset(m_pdu.content + DTM_HEADER_SIZE, RFPHY_TEST_0X55_REF_PATTERN, m_packet_length);
                break;
            
            case DTM_PKT_0XFF:
                m_pdu.content[DTM_HEADER_OFFSET] = DTM_PDU_TYPE_0XFF;
                // Bit pattern 11111111 repeated. Only available in coded PHY (Long range).
                memset(m_pdu.content + DTM_HEADER_SIZE, RFPHY_TEST_0XFF_REF_PATTERN, m_packet_length);
                break;

